Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །ང་ཡི་བུད་མེད་དག་ནི་བརྒྱད་ཁྲི་ཡང་།
en: “I had my eighty thousand wives,

source: །གཟུགས་མཛེས་ཤིན་ཏུ་བལྟ་ན་སྡུག་པ་དག །
en: Who were all alluring and very beautiful.

source: ཤིང་རྟར་ཞུགས་པས་དགེ་སློང་དེ་མཐོང་སྟེ།
en: From within their chariots they saw the bhikṣu,

source: །རི་རབ་བཞིན་དུ་གཟུགས་བཟང་དཔལ་འབར་བ།
en: Whose body had the shining splendor of Mount Meru. {86}

source: །མཐོང་ནས་དེ་དག་ཕར་ཡང་འདུ་ཤེས་བསྐྱེད།
en: “When they saw him they conceived of him as like a father,

source: །བྱང་ཆུབ་དམ་པ་མཆོག་ཏུ་སེམས་སྐྱེས་ཏེ།
en: And they developed the aspiration to attain supreme enlightenment.

source: །དེ་ཚེ་ཚངས་པའི་སྤྱོད་པར་ཡང་དག་བཙུད།
en: Then they adopted the practice of celibacy

source: །ཡིད་དུ་འོང་བའི་རྒྱན་རྣམས་དེ་ལ་གཏོར།
en: And they cast off their delightful jewelry. {87}

source: །དེ་ཚེ་ང་ནི་ཕྲག་དོག་སྐྱེས་པར་གྱུར།
en: “At that time there arose within me envy

source: །གནོད་སེམས་ཞེ་སྡང་ཐ་བ་མི་བཟད་དེ།
en: And intractable, pitiless malice and anger.

source: །དབང་ཕྱུག་རྒྱགས་པས་བུ་ལ་འདི་སྐད་སྨྲས།
en: Proud of my power, I said to my sons,

source: །མདུན་ན་འདུག་པའི་དགེ་སློང་བསད་པར་གྱིས།
en: ‘Slay that bhikṣu who is before me!’ {88}

source: །གཞོན་ནུ་དེ་དག་ང་ཡི་ཚིག་ཐོས་ནས།
en: “The princes, on hearing my words,

source: །ཤིན་ཏུ་སྡུག་བསྔལ་ཡིད་ཀྱང་མི་དགར་གྱུར།
en: Became distressed and unhappy.

source: །ཡབ་ཅིག་དེ་སྐད་ཀྱི་ནི་ཚིག་མ་གསུང་།
en: They said, ‘Father, do not speak such words!

source: །དགེ་སློང་འདི་འདྲ་བདག་ཅག་མི་འགུམས་སོ།
en: We will not slay such a bhikṣu! {89}

source: །བསྐལ་པ་བྱེ་བ་གང་གཱའི་བྱེ་སྙེད་དུ། །བདག་ཅག་ལུས་དང་ཡན་ལག་བཅད་གཏུབས་ཀྱང་།
en: “ ‘Even if our bodies and limbs were to be cut up For as many eons as there are sand grains in the Ganges,

source: །དགེ་སློང་འདི་ནི་འགུམས་པར་མི་བགྱིད་དེ།
en: Nevertheless we would never slay this bhikṣu,

source: །འདི་ལྟར་བདག་ཅག་བྱང་ཆུབ་སེམས་སྐྱེས་སོ།
en: As we have developed the aspiration for enlightenment.’ {90}

source: །རྒྱལ་པོ་དེ་ཚེ་བུ་ཡི་ཚིག་ཐོས་ནས།
en: “When the king had heard the words of his sons

source: །ཁྲོས་ཏེ་གསོད་པའི་གཤེད་མ་འབངས་ལ་སྨྲས། །ང་ཡི་བཙུན་མོའི་མདུན་ན་འདུག་པ་ཡི།
en: He furiously ordered his serving executioner,

source: །དགེ་སློང་འདི་ནི་མྱུར་དུ་སོད་དེ་ཕུལ། །དེ་ནས་གསོད་པའི་གཤེད་མ་ཕྱི་བཞིན་འོངས།
en: ‘Quickly bring to me this bhikṣu slain, Who is standing in front of my harem!’ {91} “Then the executioner named Nandika,

source: །ཤིན་ཏུ་གཏུམ་སེམས་དགའ་བྱེད་སྙིང་རྗེ་མེད།
en: Cruel and malevolent, followed him.

source: །འབྲུ་མར་ངར་བཏགས་རལ་གྲི་ཐོགས་ནས་སུ།
en: He took a sword oiled with sesame oil,

source: །དེ་ཡིས་དགེ་སློང་དུམ་བུ་བརྒྱད་དུ་བྱས།
en: And with it he cut the bhikṣu into eight pieces. {92}

source: །དེ་ཡི་ལུས་དང་ཡན་ལག་བཅད་པ་ལས།
en: “When he cut into the body and limbs,

source: །ཁྲག་ཀྱང་མི་ཟག་འོད་ཟེར་སྟོང་བྱུང་སྟེ།
en: Instead of blood a thousand light rays were emitted,

source: །བཅད་པའི་འཕྲོ་ན་དཔལ་བེའུ་འཁོར་ལོ་དག །མཚན་རྣམས་དེ་ཡི་ལུས་ཀྱི་ནང་ན་ཡོད།
en: And where it was cut open, inside the body Were symbols, such as śrīvatsas and wheels. {i}

source: །ཤིན་ཏུ་མ་རུངས་ལས་ནི་བྱས་ནས་སུ།
en: “Having committed such a dreadful act,

source: །སྐྱེད་མོས་ཚལ་དུ་དེ་ཡི་མོད་ལ་བྱུང་།
en: The king instantly departed for the park.

source: །དགེ་སློང་མེ་ཏོག་ཟླ་མཛེས་དྲན་ནས་ནི།
en: Thinking of the bhikṣu Puṣpacandra,

source: །དེ་ཡི་རྩེད་མོ་དགའ་བར་མ་གྱུར་ཏོ།
en: He could not join in amusements or be happy. {93}

source: །རིངས་པའི་གཟུགས་སུ་མྱུར་ཞིང་མགྱོགས་པར་ནི།
en: “He very quickly and in a hasty manner

source: །དེ་ནས་བདག་གི་རྒྱལ་པོའི་ཕོ་བྲང་སོང་།
en: Departed from the park to return to his palace.

source: །གང་དུ་དགེ་སློང་དུམ་བུ་བརྒྱད་བྱས་པ། །ས་ཕྱོགས་དེར་ནི་ཤིང་རྟར་ཞུགས་ནས་ཕྱིན།
en: His chariot on the way came to the place Where the bhikṣu lay in eight pieces. {94}

source: །ལྷ་རྣམས་ཁྲག་ཁྲིག་མང་པོ་བར་སྣང་ལ། །ཆོ་ངེས་འདེབས་པའི་སྒྲ་དག་དེས་ཐོས་ཏེ།
en: “There he heard the sound of the wailing Of many millions of devas in the sky.

source: །རྒྱལ་པོ་ཁྱོད་ཀྱིས་མི་དགེ་སྡིག་མང་བགྱིས།
en: They cried, ‘King, you have created so much bad karma

source: །ཤི་འཕོས་ནས་ནི་མནར་མེད་མི་བདེར་འགྲོ།
en: That when you die you will go to the miseries of the Avīci hell!’ {95}

source: །རྒྱལ་པོ་དེས་ནི་ལྷ་ཡི་སྒྲ་ཐོས་ནས།
en: “When the king had heard those words

source: །ཤིན་ཏུ་སྡུག་བསྔལ་མི་དགའ་སེམས་སྐྲག་གྱུར། །བདག་གིས་མེ་ཏོག་ཟླ་མཛེས་བཀྲོངས་པ་ནི།
en: He became distressed, sorrowful, and afraid.

source: །བདག་གིས་སྡིག་པ་མི་བཟད་མང་པོ་བགྱིས།
en: He thought, ‘I have created so much bad karma Through my having Puṣpacandra killed! {96}

source: །དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་མཐའ་ཡས་ལྡན། །སངས་རྒྱས་མི་ཡི་ཁྱུ་མཆོག་སྲས་པོ་གང་།
en: “ ‘He was the son of the buddhas, of the leaders of men, Of the tathāgatas who have infinite wisdom.

source: །དབང་པོ་བསྲུངས་ཤིང་དེས་པ་ཞི་བའི་ཡིད།
en: He controlled his senses, was caring, had a peaceful mind,

source: །དེ་ནི་འདོད་པའི་དོན་ཕྱིར་བདག་གིས་བཀྲོངས།
en: But because of my desires I had him slain. {97}

source: །དེ་བཞིན་གཤེགས་པའི་ཆོས་རྣམས་གང་འཛིན་ཅིང་།
en: “ ‘He possessed the Dharma of the tathāgatas.

source: །ཟད་པའི་དུས་ལ་དམ་པའི་ཆོས་ཀྱི་མཛོད།
en: In the age of destruction he was a treasure of the Dharma.

source: །འཇིག་རྟེན་ཀུན་ཏུ་ཆོས་ཀྱི་སྒྲོན་མ་མཛད།
en: He was a lamp of wisdom for the entire world,

source: །འཇིག་རྟེན་ཀུན་ན་སྨན་པའི་རྒྱལ་པོ་གང་།
en: “ ‘He was a king of physicians for this entire world

source: །སེམས་ཅན་ན་བ་རྟག་ཏུ་གསོ་བྱེད་ཅིང་།
en: And he was always healing beings.

source: །བདུད་རྩི་དག་གིས་བཀྲུ་སྨན་གཏོང་བ་ཡི།
en: He gave them the shining elixir of amrita,

source: །དགེ་སློང་བདག་གིས་འདོད་པའི་དོན་ཕྱིར་བཀྲོངས།
en: But because of my desires I had him slain. {i}

source: །ཞིབ་ཅིང་ཟབ་ལ་ཞི་བ་བལྟ་དཀའ་བའི། །ཆོས་རྣམས་སྐྱེ་དགུ་དག་ལ་གང་འཆད་ཅིང་།
en: “ ‘He explained to beings the Dharma That is profound, peaceful, and difficult to see.

source: །བྱང་ཆུབ་སྙིང་པོ་མཆོག་ཀྱང་གང་སྟོན་པ།
en: He was a teacher of the supreme essence of enlightenment,

source: །འདྲེན་པ་རྣམས་ཀྱི་ཆོས་ཀྱི་མཛོད་འཛིན་ཅིང་།
en: “ ‘He possessed the Dharma treasure of the guides,

source: །འཇིག་རྟེན་ལྡོངས་པའི་སྒྲོན་མར་གྱུར་པ་སྟེ།
en: And he was a lamp for a world in darkness.

source: །གཟུངས་དང་མདོ་སྡེའི་རྒྱལ་པོ་གང་འཛིན་པ།
en: He possessed the retention of the king of sūtras,

source: །དེ་ནི་ཅི་སླད་བདག་གིས་འདོད་ཕྱིར་བཀྲོངས།
en: But because of my desires I had him slain. {100}

source: །ཉོན་མོངས་མེད་ཅིང་རྣམ་དག་ཡེ་ཤེས་ཅན།
en: “ ‘He was free of the kleśas and possessed pure wisdom,

source: །ཞི་བ་རབ་ཞི་རྟག་ཏུ་མཉམ་གཞག་པ།
en: And he constantly rested in a state of peace, perfect peace.

source: །འདོད་པས་ལྡོངས་པས་བདག་གིས་དེང་བཀྲོངས་ཏེ།
en: I had him killed today because of my desires,

source: །དེས་ནི་ཤིན་ཏུ་མ་རུངས་དམྱལ་བར་ལྟུང་།
en: Which was extremely evil, and I will go to hell. {101}

source: །སངས་རྒྱས་གང་དག་འདས་དང་དེ་བཞིན་མ་བྱོན་དང་། །མི་ཡི་དམ་པ་རྒྱལ་བ་གང་ཡང་བཞུགས་པ་ནི།
en: “ ‘The buddhas of the past and of the future, And the jinas, the supreme men, of the present,

source: །བསྔགས་པ་མཐའ་ཡས་ཡོན་ཏན་རྒྱ་མཚོ་ལྡན་པ་རྣམས།
en: Who are endlessly praised and have an ocean of qualities,

source: །དེ་དག་ཀུན་ལ་ཐལ་མོ་སྦྱར་ཏེ་སྐྱབས་སུ་མཆི།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ། བམ་པོ་བཅུ་གསུམ་པ།
en: With my hands together in homage I go to them for refuge.’ {102}

source: དེ་ནས་རྒྱལ་པོ་དཔའ་བས་བྱིན་གྱིས་ཆོས་སྨྲ་བ་མེ་ཏོག་ཟླ་མཛེས་བསད་དེ་ཤི་བའི་ལུས་ཀྱི་མདོག་མ་གྱུར་པར་ས་ལ་འགྱེལ་ཅིང་འདུག་པ་མཐོང་ནས་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་སྟེ་འགྱོད་ཅིང་མྱོས་པར་གྱུར་ནས་དེའི་ཚེ་ཆོ་ངེས་རབ་ཏུ་ཆེར་བཏབ་པོ།
en: “When King Śūradatta saw that the body of the slain dharmabhāṇaka Supuṣpacandra that lay on the ground had not altered in color he was distressed, sorrowful, and remorseful. He became crazed and wailed loudly.

source: །ཆོས་སྨྲ་བ་མེ་ཏོག་ཟླ་མཛེས་དེ་ལ་ཡང་འདི་ལྟ་བུར་ཡང་དག་པའི་ཡོན་ཏན་གྱིས་བསྟོད་པ་དང་སྙིང་རྗེ་དང་ལྡན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: “He recited these mournful verses that praised the qualities of the dharmabhāṇaka Supuṣpacandra:

source: །ཀུན་ཏུ་བཟང་པོར་འཕགས་པའི་དགེ་འདུན་གྱིས།
en: “ ‘The noble saṅgha in Samantabhadra Forest

source: །ཁྱོད་ལ་རྣམ་པ་མང་པོ་བསྒོ་བ་བགྱིས།
en: Requested you in many different ways Not to go to Ratnāvatī, the capital city,

source: །ཁྱོད་ཀྱི་སྲོག་གི་བར་ཆད་བྱུང་ང་རེ། །རིན་ཆེན་ལྡན་པར་རྒྱལ་པོའི་ཁབ་མ་བཞུད།
en: Because there would be a danger to your life. {i}

source: །ཁྱོད་ཀྱིས་དགེ་སློང་དགེ་འདུན་ཚིག་མ་བཟུང་།
en: “ ‘You did not listen to that saṅgha of bhikṣus.

source: །མགོན་པོ་གྲོང་ཁྱེར་དུ་ནི་ཅི་སླད་བྱོན།
en: Why, venerable one, did you come to the town?

source: །ཁྱོད་ནི་གང་གི་དོན་དུ་བྱོན་པ་ཡི།
en: Whatever the reason might be that you came,

source: །དོན་དེ་སྒྲོན་མ་མཛད་པ་མཛད་དུ་གསོལ།
en: You should accomplish it, O lamp for the world! {ii}

source: །ལྷ་རྫས་མྱུ་གུ་སྣ་ཚོགས་བརྒྱན་པའི་ས།
en: “ ‘The ground is adorned by a variety of divine plants.

source: །གཟུགས་བཟང་གཟུགས་འབར་ཤིང་ལྗོན་མང་པོས་དཀྲིགས།
en: There is a dense multitude of shining, beautiful trees.

source: །གྲུབ་པའི་རིག་འཛིན་གནོད་སྦྱིན་མཆོག་གིས་བསྲུངས།
en: It is protected by supreme siddhas and vidyādharas,

source: །ལྷ་རྣམས་ཞུགས་ཤིང་བྱ་རྒྱལ་སྒྲ་ཡང་སྒྲོག །ཀུན་ཏུ་བཟང་པོ་སངས་རྒྱས་རྟག་བཞུགས་པ། །ནགས་ཚལ་དམ་པ་དགའ་བ་བོར་ནས་ནི།
en: It is frequented by devas, and the lords of birds sing there. {iii} “ ‘You departed from the perfect, delightful Samantabhadra Forest, where the buddhas always dwell. Gentle one, explain to me today

source: །བགྱི་བ་གང་ཕྱིར་ཁྱོད་ནི་འདིར་བྱོན་པ། །དེས་པ་བགྱི་བ་དེ་དེང་བདག་ལ་གསུངས།
en: The reason why you came here. {iv}

source: །ཁྱོད་ཀྱི་ཚིག་ཐོས་ནས་ནི་བཀའ་བཞིན་བགྱི།
en: “ ‘When I have heard your words, I will fulfill your command.

source: །སངས་རྒྱས་སྲས་པོ་བཞེངས་ལ་བཀའ་སྩོལ་ཅིག །ཀྱེ་མ་ད་ནི་ཅི་བགྱི་ལྷ་ཡི་ལྷ།
en: Son of the Buddha, arise and give me your instruction. Alas, what shall I do, god of gods,

source: །བདག་ནི་མགོན་མེད་ཁྱོད་ཀྱི་སྐྱབས་སུ་མཆི།
en: I am helpless and go to you for refuge! {v}

source: །གཅིག་པུ་སེང་གེ་རི་དགས་རྒྱལ་པོ་ལྟར།
en: “ ‘Alone like a lion, the king of animals,

source: །དགེ་སློང་དགེ་འདུན་མཆོག་གི་ཁྱུ་བོར་ནས།
en: You left your pride, a supreme saṅgha of bhikṣus,

source: །སེམས་ཅན་མཐའ་ཡས་པ་ལ་ཐུགས་བརྩེའི་ཕྱིར།
en: And with compassion for endless beings,

source: །རང་གི་སྲོག་ཀྱང་བཏང་སྟེ་འདིར་བྱོན་ན།
en: With no regard for your own life, you came here. {vi}

source: །འདོད་ཆགས་ཟིལ་ནོན་ཤིན་ཏུ་འཇུངས་པ་ཡིས།
en: “ ‘I was overcome with desire and envy

source: །བདག་གིས་དཔའ་བོ་དུམ་བུ་དུམ་བུར་བཅད།
en: And had this hero cut into pieces.

source: །འདི་ནི་དགེ་སློང་དགེ་འདུན་མཐའ་དག་ཀྱང་།
en: Now your entire saṅgha of bhikṣus

source: །ཁྱོད་ལ་ལྟ་བར་ཕོ་བྲང་མ་ལྷགས་པར།
en: Has come to the capital in order to see you. {vii}

source: །བདག་ནི་འཇིགས་སྐྲག་ཁྱོད་ལ་ཅི་གསོལ་པ།
en: “ ‘That which I, terrified, request of you,

source: །བདེ་བར་གསོལ་བ་གཅིག་ནི་མཛད་པར་འོས།
en: It is a request that is worthy to be fulfilled.

source: །མེ་ཏོག་ཟླ་མཛེས་མི་འཇིགས་བདག་སྩོལ་ལ།
en: Puṣpacandra, I pray you free me from fear

source: །ཉ་དུས་ཟླ་བ་ཉ་འདྲར་བཞེངས་སུ་གསོལ།
en: And that you rise like the moon when it is full. {viii}

source: །སེམས་ཅན་གཙོ་བོ་བདག་ལ་གནང་བར་མཛོད། །ཆོས་སྨྲ་ཁྱོད་ནི་ཞེ་སྡང་རྣམ་པར་གྲོལ།
en: “ ‘Dharmabhāṇaka who is liberated from anger, Lord of beings, bestow this favor on me.

source: །དེ་རིང་བདག་ལ་སྣ་གཅིག་གནང་བར་མཛོད།
en: Today, bestow this one favor on me:

source: །ཉི་མ་བཞིན་དུ་སྣང་མཛད་བཞེངས་སུ་གསོལ།
en: I pray that you arise, shining like the sun. {ix} “ ‘I have committed an evil, sinful act.

source: །ཆོས་སྨྲ་མཆོག་ནི་བདག་གིས་བཀྲོངས་བགྱིས་ཏེ། །སྡིག་པ་མ་ལེགས་བདག་གིས་དེང་བགྱིས་པ།
en: I have slain the supreme dharmabhāṇaka.

source: །འདི་ནས་འཆི་འཕོས་མི་བཟད་དམྱལ་བར་སྐྱེ།
en: When I die I will be reborn in a terrible hell,

source: །བདག་ལ་དེ་ཡི་སྐྱབས་སུ་འགྱུར་བ་མེད།
en: And I have no one who can save me from that. {103}

source: །ཉོན་མོངས་བྱེད་པ་སྡིག་སེམས་ཅི་རུ་རུང་།
en: “ ‘Shame upon this sinful mind that creates calamity!

source: །རྒྱགས་པས་ཁེངས་པའི་རྒྱལ་སྲིད་ཅི་རུ་རུང་།
en: Shame upon this kingship of pride and arrogance!

source: །ཐམས་ཅད་སྤངས་ཏེ་གཅིག་པུ་འགྲོ་བར་འགྱུར།
en: I will have to go alone, leaving all behind,

source: །འདི་ནས་བདག་གིས་སྙིང་པོ་ཅི་མ་བླངས།
en: Without taking any possessions with me. {104}

source: །འདོད་ཆགས་ཞེ་སྡང་བཅོམ་པ་རྣམ་དག་ཆོས།
en: “ ‘You have the pure Dharma, and have defeated desire and anger.

source: །སྙན་པར་གསུང་བ་བདག་ཐུལ་ཐུགས་རྗེ་ཅན།
en: You speak pleasant words, are self-controlled, and compassionate.

source: །འགྲོ་བའི་གཉེན་གཅིག་སུན་འབྱིན་མི་མཛད་པ།
en: You do no wrong, and are the sole friend of beings.

source: །མེ་ཏོག་ཟླ་མཛེས་བདག་གིས་ཅི་ཕྱིར་བཀྲོངས།
en: Supreme Puṣpacandra, why did I slay you? {105}

source: །ཀྱེ་མ་བཟོད་དང་དཀའ་ཐུབ་ནོར་ཕྱུག་བརྟུལ་ཞུགས་བཟང་།
en: “ ‘Ah! You who are wealthy in discipline, patience, and austerity! Ah!

source: །ཀྱེ་མ་གཟུགས་དང་དེས་པ་དག་གི་ཡོན་ཏན་ལྡན།
en: You who possess the qualities of a handsome form and kindness! Ah!

source: །ཀྱེ་མ་གཡོ་མེད་དཔལ་སྟུག་སྤྲོས་པ་མི་མངའ་བ།
en: You who are honest, glorious, and trustworthy—

source: །བདག་ཅག་བོར་ནས་ཁྱོད་ནི་གང་དུ་བཞུད་པར་མཛད།
en: Where have you gone, leaving us behind? {106}

source: །འཕགས་པ་ཁྱོད་ཀྱི་ལུས་དང་ཡན་ལག་བཅད་པ་ན།
en: “ ‘Noble one, when your body and limbs were cut,

source: །འོ་མ་རབ་ཏུ་ཟག་ཅིང་འོད་ཟེར་སྟོང་དག་བྱུང་།
en: Milk flowed out and thousands of light rays shone forth.

source: །འཇིག་རྟེན་འདི་དག་ཐམས་ཅད་ཤིན་ཏུ་ངོ་མཚར་གྱུར།
en: The entire world was astonished.

source: །ངོ་མཚར་ཆེ་བའི་རང་བཞིན་འདྲེན་པ་བཞེངས་སུ་གསོལ།
en: My wondrous guide, I pray that you arise! {i} “ ‘Ah!

source: །ཀྱེ་མ་མེ་ཏོག་ཟླ་བ་དུལ་བ་ཐུགས་རྗེ་ཅན།
en: Puṣpacandra, you are self-controlled and compassionate! Ah!

source: །ཀྱེ་མ་བྱམས་དང་སྙིང་རྗེའི་ཕུང་པོ་རི་བོ་ཚུར།
en: Come here, you mountain of love and compassion! Ah!

source: །ཀྱེ་མ་ཆོས་རྣམས་ཟབ་མོ་ཤིན་ཏུ་སྟོན་པའི་མཆོག །ལྷ་ཁྱོད་བཞེངས་ཤིག་བདག་ལ་ཐུགས་བརྩེར་མཛད་དུ་གསོལ།
en: You are a supreme teacher of the profound Dharma— Divine one, I pray that you be compassionate to me and arise. {ii} “ ‘Ah!

source: །ཀྱེ་མ་ཟླ་བ་ཉ་ཞལ་ཚུར་སྤྱོན་ཅིག །ཀྱེ་མ་ས་བཅུ་ལེགས་གནས་ཚུར་སྤྱོན་ཅིག །ཀྱེ་མ་དཔའ་བོ་སྟོབས་བཅུ་མངོན་འཕགས་པ།
en: Come here, you who have the face of a full moon! Ah! Come here, you who are upon the ten bhūmis! Ah! You are a hero who has power over the ten bhūmis—

source: །ཚེ་ལ་ཁྱོད་དབང་བདག་པོ་གང་དུ་བཞུད།
en: You, who have power over life, where you have gone? {iii} “ ‘Ah!

source: །ཀྱེ་མ་དཔའ་བོ་ཚུར་སྤྱོན་བདག་ལ་གསུངས།
en: Come here and speak to me! Ah!

source: །ཁྱོད་ཀྱིས་ཡུན་རིང་བཟོད་པ་བསྒོམས་པ་དང་། །བརྩོན་འགྲུས་ཐུགས་རྗེ་དེ་དག་གང་དུ་མཆིས།
en: You who are so diligent and compassionate, where have you gone? Ah! You have meditated for a long time on patience—

source: །བྱམས་པ་ཆེན་པོ་བཞེངས་ལ་གསུང་ཕྱུང་ཞིག །ཀྱེ་མ་ཤིན་ཏུ་མཆོད་འོས་ལྷ་ཡི་ལྷ།
en: You who have great love, arise and speak to me! {iv} “ ‘Ah! God of gods, you who are worthy of offerings,

source: །ཆོས་སྨྲ་ཅང་མི་གསུང་བར་ཅི་སླད་བཞུགས།
en: Dharmabhāṇaka, why do you continue to remain silent?

source: །མཁས་པ་བཞེངས་ལ་བདག་གི་ཁྱིམ་དུ་བཞུད།
en: Arise, wise one, come into my home

source: །བུད་མེད་ཚོགས་ལ་ཁྱོད་ཀྱིས་ཆོས་སྟོན་ཅིག །ལྷ་ཁྱོད་ལུས་ནི་གཅད་པར་མི་ནུས་ཏེ།
en: And teach the Dharma to the city’s women. {v} “ ‘Divine one, it is not possible to cut up your body.

source: །ལྷ་དང་ལྷ་མིན་གནོད་སྦྱིན་སྲིན་པོས་ཀྱང་།
en: Even the devas, asuras, yakṣas, and rākṣasas

source: །ཁྱོད་ཀྱི་ལྷ་ཡི་ལུས་འདི་མི་ཤིགས་ཀྱིས།
en: Are unable to destroy this body of yours.

source: །མཁས་པ་ཁྱོད་དེང་སྒྱུ་དག་མ་མཛད་ཅིག །ལྷ་ཁྱོད་སྒྱུ་མཛད་བཞུགས་པ་ག་ལ་གདའ།
en: Wise one, do not perform this illusion today. {vi} “ ‘Divine one why do you continue with this illusion?

source: །བྱང་ཆུབ་སེམས་དཔའ་སྒྱུ་མ་མི་མཛེས་སོ།
en: This is not a beautiful bodhisattva illusion.

source: །སྒྱུ་མ་ཐམས་ཅད་སྤོངས་ལ་བཞེངས་སུ་གསོལ།
en: Abandon all illusions and arise,

source: །རིན་ཆེན་ལྡན་པའི་གྲོང་དུ་ཆོས་ཤོད་ཅིག །ཀྱེ་མ་འཕགས་པ་མེ་ཏོག་ཟླ་མཛེས་ཚུར།
en: And teach the Dharma in the city of Ratnāvatī. {vii} “ ‘Ah! Come here, noble Puṣpacandra! Ah!

source: །ཀྱེ་མ་ཁམས་གསུམ་འདོད་ཆགས་བྲལ་བ་ཚུར།
en: Come here, you who are without desire for the three realms! Ah!

source: །ཀྱེ་མ་ཕ་མ་ལྟ་བུ་འདྲེན་པ་ཚུར།
en: Come here, guide who is like a father and mother—

source: །བདག་གི་སེམས་དམྱལ་སྒོ་ནི་བཅད་དུ་གསོལ།
en: And close the door through which I will go to hell. {viii}

source: །ངན་སོང་སྐྱེས་པ་རྣམས་ཀྱི་རྟེན་དང་དཔུང་།
en: “ ‘You are the refuge for those beings reborn in the lower realms,

source: །སྲོག་ཆགས་མནར་མེད་ཆེན་པོར་ལྷུང་བ་ཡི།
en: And for beings who are falling into the great Avīci hell.

source: །སྐྱབས་མཛད་མེ་ཏོག་ཟླ་མཛེས་ཚུར་སྤྱོན་ཅིག །བདག་གི་བདེ་འགྲོའི་སྒོ་ཡང་དབྱེ་བར་གསོལ།
en: Come here, Protector Supuṣpacandra, And open the door through which I can go to the higher realms! {ix}

source: །མགོན་པོ་ཁྱོད་ནི་དགུང་བདུན་བཤོས་མ་གསོལ།
en: “ ‘Lord, for seven days you did not eat. Arise and eat a meal in my home.

source: །རེ་ཤིག་དེང་བཞེངས་བདག་གི་བཤོས་གསོལ་ཅིག །བདག་གིས་བཤོས་གསོལ་རིན་ཆེན་ལྡན་པ་འདིར།
en: Having eaten a meal, then in Ratnāvatī

source: །སེམས་ཅན་དུ་མ་ཆོས་ལ་དགོད་པ་མཛོད།
en: Establish many beings in the Dharma. {x} “ ‘Ah!

source: །ཀྱེ་མ་ཆོས་མཆོག་རྟོགས་པ་བདག་གི་ཡབ།
en: My father who is wise in the supreme Dharma! Ah!

source: །ཀྱེ་མ་སེམས་ཅན་རྣམས་ལ་ཁོན་མེད་སེམས།
en: You who have no enmity toward any being! Ah!

source: །ཀྱེ་མ་ཚུར་སྤྱོན་བདག་མདུན་ཆོས་སྟོན་ཅིག །ཀྱེ་མ་ཚུར་སྤྱོན་ཁྱོད་སྨོན་མྱུར་གྲུབ་ཤོག །དགེ་སློང་དགེ་འདུན་དེ་ནི་མགོན་མེད་གྱུར།
en: Come here before me and teach me the Dharma! Ah! Come here and quickly fulfill my prayers! {xi} “ ‘Ah! The saṅgha of bhikṣus do not have their lord! Ah!

source: །ཀྱེ་མ་མདོངས་ཤིང་མི་དྲན་མྱ་ངན་བགྱིད།
en: They are blinded, distressed, and in sorrow! Ah!

source: །སེམས་ཅན་སྙིང་པོ་ཁྱོད་ནི་མྱུར་བཞེངས་ལ།
en: Arise quickly, you who are the most precious being—

source: །དགེ་སློང་དགེ་འདུན་དབུགས་ཀྱང་དབྱུང་བར་མཛོད།
en: And having arisen bring relief to this saṅgha of bhikṣus. {xii}

source: །ཀྱེ་མ་འཇིག་རྟེན་གསུམ་ན་སྒྲོན་གྱུར་པ།
en: “ ‘Ah! Come here, you who are a light for the three realms! Ah!

source: །ཀྱེ་མ་ཚུར་སྤྱོན་ཀུན་ཏུ་བཟང་པོར་བཞུད།
en: Come and enter the Samantabhadra Forest!

source: །ཀུན་ཏུ་བཟང་པོའི་ནགས་ཁྲོད་བཞུད་ནས་ནི།
en: Enter the supreme forest, Samantabhadra,

source: །དགེ་སློང་དག་ལ་ཕན་ཕྱིར་ཁྱོད་སྟོན་ཅིག །ཀྱེ་ཀྱེ་ཆོས་འཛིན་ཡོན་ཏན་རྨད་བྱུང་ཆེ།
en: And teach so as to benefit the bhikṣus. {xiii} “ ‘Oh! Oh! You possess the Dharma and have marvelous qualities.

source: །ཨ་ཤྭད་མེ་ཏོག་བཞིན་དུ་རྙེད་པར་དཀའ།
en: You are as rare as a flower on the sacred fig tree. Oh! Oh! Look upon the saṅgha of bhikṣus

source: །ཤེས་རབ་ཐུགས་རྗེའི་སྤྱན་ནི་དྲི་མེད་པ།
en: With your stainless eyes of wisdom and compassion. Oh! Oh!

source: །ཀྱེ་ཀྱེ་དགེ་སློང་དགེ་འདུན་གཟིགས་སུ་གསོལ།
en: Teach to the bhikṣus

source: །ཚིག་གི་ལམ་དང་བྲལ་བའི་གཟུགས་དེ་ཡང་།
en: The retention that is beyond words. Oh! Oh!

source: །ཀྱེ་ཀྱེ་དགེ་སློང་དག་ལ་བསྟན་དུ་གསོལ།
en: Puṣpacandra, arise here today

source: །ཀྱེ་ཀྱེ་ཟླ་བ་ཤར་བ་བཞིན་དུ་འདིར། །མེ་ཏོག་ཟླ་བ་དེ་རིང་བཞེངས་སུ་གསོལ།
en: Like the rising moon. {xiv}

source: །ཀྱེ་ཀྱེ་རྒྱལ་སྲས་བདག་ལ་ཐུགས་བརྩེ་བ།
en: “ ‘Oh! Oh! Son of the jinas, who has compassion for me,

source: །དབུགས་འབྱིན་མཛད་པ་སྟོན་པ་བླ་ན་མེད།
en: Unsurpassable teacher, bring me relief. Oh! Oh!

source: །ཀྱེ་ཀྱེ་མཚོན་དང་དབྱུག་པས་བཏབ་པ་བཟོད།
en: You who when struck by swords and sticks

source: །བཟོད་པའི་སྟོབས་དང་ལྡན་ཞིང་རབ་ཏུ་དེས།
en: Have the power of great patience and kindness. Oh! Oh!

source: །ཀྱེ་ཀྱེ་མེ་ཏོག་ཟླ་མཛེས་ཐུགས་རྗེ་ཅན།
en: Compassionate Supuṣpacandra,

source: །རབ་སྦྱིན་འདྲེན་པ་ཁྱོད་ནི་བཞེངས་སུ་གསོལ།
en: Generous guide, I pray that you arise. Oh! Oh!

source: །ཀྱེ་ཀྱེ་ཁྱོད་ནི་བཞེངས་ལ་བདག་ལ་ཡང་།
en: Arise and teach to me

source: །མཐོང་བར་དཀའ་བའི་གཟུངས་རྣམས་བཤད་དུ་གསོལ། །ཀྱེ་ཀྱེ་འཇིག་རྟེན་ཀུན་ཏུ་སྣང་མཛད་པ།
en: The retention that is difficult to see. {xv}

source: །ཤེས་རབ་ཀྱི་ནི་སྒྲོན་མ་དམ་པའི་མཆོག །ཀྱེ་ཀྱེ་སེམས་ཅན་དག་གི་ཕན་དོན་ལ།
en: “ ‘Oh! Oh! You are the supreme lamp of wisdom That illuminates the entire world. Oh! Oh! You are dedicated to the benefit of beings;

source: །བརྩོན་མཛད་འདྲེན་པ་ཐུགས་རྗེའི་སྟོབས་བཅུ་ལྡན།
en: You are the guide with the strength of compassion. Oh! Oh!

source: །ཀྱེ་ཀྱེ་མེ་ཏོག་ཟླ་མཛེས་བཞེངས་སུ་གསོལ།
en: Arise, Puṣpacandra, the hero

source: །དཔའ་བོ་སེམས་ཅན་དག་གི་དོན་མཛད་པ།
en: Who accomplishes the benefit of beings. Oh! Oh!

source: །ཀྱེ་ཀྱེ་སེམས་ཅན་དག་ནི་བྱེ་བ་དང་། །ཁྲག་ཁྲིག་རྣམས་ཀྱང་ཞི་བའི་གྲོང་དུ་ཁོད།
en: Arise and bring trillions Of beings to the city of peace. {xvi}

source: །ཀྱེ་ཀྱེ་ཚུལ་ཁྲིམས་ནོར་ལྡན་བློ་གྲོས་ཆེ།
en: “ ‘Oh! Oh! You who have the wealth of correct conduct,

source: །མཁས་པ་བསླབས་པའི་ནོར་གྱིས་ཤིན་ཏུ་ཕྱུག །ཀྱེ་ཀྱེ་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་རབ་གནས་ཤིང་།
en: You have understanding, the wealth of training, and are wise. Oh! Oh! You remain in the discipline of correct conduct

source: །ཆོས་ཀྱི་ཤིང་གི་མྱུ་གུ་མངོན་པར་དགའ།
en: And rejoice in the seedlings of the trees of Dharma. Oh! Oh!

source: །ཀྱེ་ཀྱེ་ཆོས་གོས་ངུར་སྨྲིག་ཁ་བསྒྱུར་འཆང་།
en: You wear the orange dyed dharma robes,

source: །རྟག་ཏུ་མངོན་པར་བྱུང་ལ་དགའ་བར་མཛད།
en: And are always satisfied by renunciation. Oh! Oh!

source: །ཀྱེ་ཀྱེ་མེ་ཏོག་ཟླ་བ་བརྟུལ་ཞུགས་མཆོག །རབ་སྦྱིན་དཀའ་ཐུབ་བཟང་པོ་ཁྱོད་བཞེངས་ཤིག །ཀྱེ་ཀྱེ་དུལ་བ་སེམས་ཅན་མ་དུལ་འདུལ།
en: Arise, glorious Puṣpacandra, Who has perfect discipline, generosity, and austerity. {xvii} “ ‘Oh! Oh! Tamed one who tames untamed beings,

source: །རྟག་པར་དུལ་བའི་གནས་དང་རྗེས་སུ་ལྡན།
en: Who always has the state of being tamed. Oh! Oh!

source: །ཀྱེ་ཀྱེ་དུལ་བ་རབ་དུལ་རྗེས་སུ་བཞུད།
en: Tamed one who follows those who are tamed,

source: །ཞི་བ་དབང་པོ་རབ་ཞི་ཁོང་ནས་དེས།
en: Who is peaceful, and who has pacified senses. Oh! Oh!

source: །ཀྱེ་ཀྱེ་སེམས་ཅན་ཉལ་ཞིང་གཉིད་ལོག་པ། །ཆོས་ཀྱི་སྒྲ་ཡིས་རྟག་ཏུ་སད་པར་མཛོད།
en: You continually with the sound of the Dharma Awaken beings who are asleep, deeply asleep. Oh! Oh!

source: །ཀྱེ་ཀྱེ་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་དག །སད་པར་བགྱིས་ནས་ཐེག་པ་མཆོག་ལ་ཁོད།
en: You awaken millions of beings And establish them in the highest yāna. {xviii}

source: །ཀྱེ་ཀྱེ་སྦྱིན་པ་ཡི་ནི་སྤང་ལེབ་ལ།
en: “ ‘Oh! Oh! With the planks of generosity

source: །བརྩོན་འགྲུས་ཐག་གུས་སྦྲེལ་བའི་གྲུ་སྦྱོར་ཏེ།
en: You have made a ship and tied it with the ropes of diligence. Oh! Oh! You rescue the beings who

source: །ཀྱེ་ཀྱེ་སེམས་ཅན་རྒྱ་མཚོ་ཆེན་པོར་ནི། །རབ་ཏུ་ལྷུང་ཞིང་སྲིད་པས་དེད་པ་རྣམས།
en: By craving have fallen into the great ocean. Oh! Oh!

source: །ཀྱེ་ཀྱེ་སྟོབས་བཅུ་ལྡན་པ་མེ་ཏོག་མཆོག །མཉན་པ་གདོས་འཛིན་མཁས་པ་བཞེངས་སུ་གསོལ།
en: Arise, Supuṣpa, with the ten strengths, You who are the wise pilot of the ship. Oh! Oh!

source: །ཀྱེ་ཀྱེ་ཤིན་ཏུ་སྲ་བའི་གྲུར་ཡང་ནི།
en: Sail that stable ship

source: །ཞུགས་ནས་བདག་དང་དེ་དག་བསྒྲལ་བར་མཛོད།
en: And come and rescue me too. {xix}

source: །ཀྱེ་ཀྱེ་སྨན་པའི་དམ་པ་བརྟུལ་ཞུགས་ལ།
en: “ ‘Oh! Oh! You are the supreme doctor, practiced in discipline;

source: །ཤིན་ཏུ་སྤྱད་ཅིང་རིག་མཛད་སྨན་པའི་མཆོག །ཀྱེ་ཀྱེ་ཡེ་ཤེས་རྣམ་གྲོལ་ཕ་རོལ་ཕྱིན།
en: You are the unsurpassable doctor, learned in healing. Oh! Oh! You have attained the perfection of liberation through wisdom

source: །དམ་པའི་ཆོས་ཀྱི་རྩི་དག་སྦྱིན་མཛད་པ། །ཀྱེ་ཀྱེ་ནད་ནི་རྣམ་པ་སྣ་ཚོགས་ཀྱིས།
en: And you bestow the medicine that is the good Dharma. Oh! Oh!

source: །བཏབ་པའི་སེམས་ཅན་ན་བ་རྣམས་གཟིགས་ནས།
en: When you see beings who are sick, Afflicted with all kinds of illnesses, Oh! Oh!

source: །ཀྱེ་ཀྱེ་མྱུར་དུ་བཞེངས་ལ་དེ་དག་ལ།
en: arise quickly and give them

source: །ཆོས་ཀྱི་སྨན་རྣམས་ཤིན་ཏུ་སྩལ་བར་མཛོད།
en: The medicine of the Dharma. {xx}

source: །ཀྱེ་ཀྱེ་ཡེ་ཤེས་སྨན་པའི་རྒྱལ་པོ་མཆོག །མཚུངས་མེད་ཡེ་ཤེས་འཕགས་ཤིང་ཕ་རོལ་ཕྱིན།
en: “ ‘Oh! Oh! King of the medicine of wisdom, unequaled, You have reached the perfection of superior wisdom. Oh! Oh!

source: །ཀྱེ་ཀྱེ་ནད་རྣམས་ཤིན་ཏུ་གསོ་མཛད་ཅིང་།
en: You completely cure all illnesses.

source: །ཐུགས་རྗེས་སེམས་ཅན་དག་གི་དོན་ཀྱང་མཛད།
en: With compassion you accomplish the benefit of beings. Oh! Oh!

source: །ཀྱེ་ཀྱེ་ན་བར་གྱུར་པའི་སེམས་ཅན་ཁམས།
en: Everyone in the realm of sick beings

source: །འདོད་ཆགས་ནད་ཀྱིས་མ་ལུས་བཅོམ་པ་རྣམས།
en: Is afflicted by the illness of desire. Oh! Oh!

source: །དེས་ནི་སེམས་ཅན་ཐམས་ཅད་བདེ་བ་དང་། །ནད་རྣམས་མེད་ཅིང་མྱ་ངན་འདས་པར་འགྱུར།
en: You make all those beings Happy, healthy, and reach nirvāṇa. {xxi}
